{
  "game_type": "matching_puzzle",
  "title": "Methoden zur Kundenberatung – Matching",
  "schema_version": "1.0",
  "subtitle": "Ziel: Kombiniere jeweils die passende Beratungsmethode mit der richtigen Kurzbeschreibung und einem typischen Praxisbeispiel.",
  "columnTitles": {
    "column1": "Methode/Begriff",
    "column2": "Kurzbeschreibung",
    "column3": "Praxisbeispiel"
  },
  "columnHints": {
    "column1": "Wähle eine Beratungs- oder Kommunikationsmethode.",
    "column2": "Wähle die passende Definition.",
    "column3": "Ordne ein realistisches Beispiel zu."
  },
  "sets": [
    {
      "id": "medieneinsatz_webinar",
      "name": "Medieneinsatz: Kundenpräsentation per Webinar",
      "description": "Präsentation und Beratung über digitale Kanäle (Screensharing, Demos, Slides), um ortsunabhängig Inhalte zu vermitteln und Fragen zu klären.",
      "example": "Im Webinar zeigt der Berater live die neue Ticketmaske per Screenshare und sammelt direkt Feedback im Chat."
    },
    {
      "id": "online_schulungen",
      "name": "Online-Schulungen",
      "description": "Strukturierte Trainings im virtuellen Format (Live oder asynchron) mit Lernzielen, Übungen und Erfolgskontrolle.",
      "example": "Neue Mitarbeitende absolvieren ein 45-minütiges Training zur Passwort-Policy inklusive Mini-Quiz am Ende."
    },
    {
      "id": "homepage",
      "name": "Homepage als Beratungskanal",
      "description": "Webseite als Informations- und Vertrauenskanal: Leistungen erklären, FAQs, Kontaktwege, Referenzen und Support-Informationen bereitstellen.",
      "example": "Die Homepage enthält eine FAQ zu VPN-Zugang, einen Self-Service-Bereich und ein Kontaktformular für Supportanfragen."
    },
    {
      "id": "sender_empfaenger_modell",
      "name": "Kommunikationsmodell: Sender-Empfänger",
      "description": "Kommunikation als Übertragung einer Nachricht mit möglichen Störungen (z. B. Missverständnisse, Kanalprobleme); Feedback stellt Verständnis sicher.",
      "example": "Nach der Erklärung fragt der Berater gezielt nach: „Können Sie kurz zusammenfassen, was wir jetzt als Nächstes tun?“"
    },
    {
      "id": "eisbergmodell",
      "name": "Kommunikationsmodell: Eisbergmodell",
      "description": "Sachinhalt ist sichtbar, Beziehungsebene wirkt darunter; Tonfall, Haltung und Vertrauen beeinflussen die Wirkung stärker als Fakten.",
      "example": "Der Kunde klingt genervt: Der Berater adressiert zuerst die Frustration („Ich sehe, das nervt gerade“) bevor er technische Details erklärt."
    },
    {
      "id": "vier_ohren_modell",
      "name": "Kommunikationsmodell: 4-Ohren-Modell",
      "description": "Nachrichten werden auf vier Ebenen gehört: Sachinhalt, Selbstoffenbarung, Beziehung, Appell; hilft Missverständnisse einzuordnen.",
      "example": "„Das dauert ja ewig“ wird nicht nur sachlich verstanden, sondern auch als Appell („Bitte schneller lösen“) und Beziehungssignal."
    },
    {
      "id": "cross_selling",
      "name": "Cross-Selling",
      "description": "Zusatzprodukte oder ergänzende Leistungen anbieten, die zum ursprünglichen Bedarf passen und den Nutzen erhöhen.",
      "example": "Zum Laptop-Angebot empfiehlt der Berater eine Dockingstation und ein Headset, weil der Kunde viel im Homeoffice arbeitet."
    },
    {
      "id": "upselling",
      "name": "Upselling",
      "description": "Höherwertige Variante des gewünschten Produkts/Service anbieten, wenn sie besser zum Bedarf passt (mehr Leistung, bessere Qualität, mehr Sicherheit).",
      "example": "Statt Basis-Backup wird ein Backup mit Versionierung und Offsite-Speicher vorgeschlagen, weil der Kunde hohe Verfügbarkeitsanforderungen hat."
    },
    {
      "id": "zielgruppenfokus",
      "name": "Zielgruppenfokus in der Beratung",
      "description": "Beratung wird an Rolle und Kontext angepasst: Entscheider brauchen Nutzen, Kosten und Risiko; Anwender brauchen Bedienung und Alltagstauglichkeit.",
      "example": "Für die Leitung: TCO und Risikoreduktion; für die Mitarbeitenden: kurze Live-Demo und Schritt-für-Schritt-Anleitung."
    },
    {
      "id": "demo_storytelling",
      "name": "Demo & Storytelling",
      "description": "Lösungen anhand konkreter Szenarien zeigen, statt nur Features aufzuzählen; macht Nutzen greifbar und reduziert Rückfragen.",
      "example": "Der Berater führt durch ein Szenario: „Neuer Mitarbeiter → Onboarding → Rechte → erster Login“ und zeigt den Ablauf im System."
    }
  ]
}
