{
  "game_type": "what_and_why",
  "title": "What & Why – Datenschutz (DSGVO/BDSG)",
  "description": "Schritt 1: Passenden Begriff / Rechtsrahmen / Betroffenenrecht wählen (What) · Schritt 2: Zutreffende Begründungen markieren (Why).",
  "cases": [
    {
      "id": "c01",
      "profile": "Ein Unternehmen verarbeitet Kundendaten (Name, Adresse, E-Mail, Bestellhistorie) und betreibt einen Onlineshop in der EU. Es will wissen, welches zentrale Datenschutzgesetz dafür maßgeblich ist.",
      "tags": ["DSGVO", "EU", "Rechtsrahmen"],
      "options": [
        {
          "id": "dsgvo",
          "label": "DSGVO",
          "isCorrect": true,
          "whys": [
            { "id": "w1", "text": "Die DSGVO ist der zentrale EU-Rechtsrahmen für die Verarbeitung personenbezogener Daten.", "correct": true },
            { "id": "w2", "text": "Sie gilt grundsätzlich für Unternehmen/Organisationen, die in der EU Daten verarbeiten.", "correct": true },
            { "id": "w3", "text": "Die DSGVO gilt nur für Behörden, nicht für Unternehmen.", "correct": false },
            { "id": "w4", "text": "Nationale Gesetze können ergänzen, aber die DSGVO ist der Kern.", "correct": true }
          ]
        },
        {
          "id": "bdsg",
          "label": "BDSG",
          "isCorrect": false,
          "whys": [
            { "id": "w1", "text": "Das BDSG ist ein nationales Gesetz (Deutschland), das die DSGVO ergänzt.", "correct": true },
            { "id": "w2", "text": "Es ersetzt die DSGVO vollständig für EU-Unternehmen.", "correct": false },
            { "id": "w3", "text": "Es kann spezielle Regelungen enthalten (z. B. in Öffnungsklauseln), aber nicht „statt DSGVO“.", "correct": true },
            { "id": "w4", "text": "Für den EU-weiten Grundrahmen ist primär die DSGVO entscheidend.", "correct": true }
          ]
        }
      ],
      "solution": "DSGVO: zentraler EU-Rahmen für Verarbeitung personenbezogener Daten; nationale Gesetze (z. B. BDSG) ergänzen nur."
    },
    {
      "id": "c02",
      "profile": "Eine deutsche Organisation fragt: „Neben DSGVO – wo stehen in Deutschland zusätzliche, konkrete Regeln, z. B. zu besonderen nationalen Ausgestaltungen?“",
      "tags": ["BDSG", "National", "Ergänzung"],
      "options": [
        {
          "id": "bdsg",
          "label": "BDSG",
          "isCorrect": true,
          "whys": [
            { "id": "w1", "text": "Das BDSG ergänzt die DSGVO in Deutschland (nationale Ausgestaltung).", "correct": true },
            { "id": "w2", "text": "Es kann dort greifen, wo die DSGVO Öffnungsklauseln lässt.", "correct": true },
            { "id": "w3", "text": "BDSG ist ein EU-weit einheitliches Regelwerk für alle Mitgliedstaaten.", "correct": false },
            { "id": "w4", "text": "In Deutschland schaut man typischerweise auf DSGVO + BDSG (und ggf. Spezialgesetze).", "correct": true }
          ]
        },
        {
          "id": "dsgvo_allein",
          "label": "Nur DSGVO (keine nationalen Ergänzungen)",
          "isCorrect": false,
          "whys": [
            { "id": "w1", "text": "Die DSGVO ist zwar zentral, aber nationale Ergänzungen können relevant sein.", "correct": true },
            { "id": "w2", "text": "Es gibt in Deutschland keine ergänzenden Datenschutzgesetze.", "correct": false },
            { "id": "w3", "text": "Prüfungspraktisch: DSGVO-Grundlagen + nationale Ergänzungen kennen.", "correct": true },
            { "id": "w4", "text": "Spezialbereiche (z. B. national geregelte Details) können außerhalb der DSGVO konkretisiert sein.", "correct": true }
          ]
        }
      ],
      "solution": "BDSG: nationales Datenschutzgesetz in Deutschland, das die DSGVO ergänzt (dort, wo nationale Ausgestaltung möglich ist)."
    },
    {
      "id": "c03",
      "profile": "Ein Azubi sagt: „Personenbezogene Daten sind nur Name und Adresse. Eine IP-Adresse oder eine Kundennummer zählt nicht.“ Du sollst den Begriff korrekt einordnen.",
      "tags": ["Personenbezogene Daten", "Definition", "Beispiele"],
      "options": [
        {
          "id": "personenbezogene_daten",
          "label": "Personenbezogene Daten",
          "isCorrect": true,
          "whys": [
            { "id": "w1", "text": "Personenbezogene Daten sind Informationen, die sich auf eine identifizierte oder identifizierbare natürliche Person beziehen.", "correct": true },
            { "id": "w2", "text": "Dazu können auch Kennungen wie Kundennummern oder Online-Kennungen gehören (je nach Identifizierbarkeit).", "correct": true },
            { "id": "w3", "text": "IP-Adressen und Nutzerkennungen sind niemals personenbezogene Daten.", "correct": false },
            { "id": "w4", "text": "Entscheidend ist, ob eine Person direkt oder indirekt identifiziert werden kann.", "correct": true }
          ]
        },
        {
          "id": "anonymisierte_daten",
          "label": "Anonymisierte Daten",
          "isCorrect": false,
          "whys": [
            { "id": "w1", "text": "Anonymisierte Daten sind so verändert, dass keine Person mehr identifizierbar ist.", "correct": true },
            { "id": "w2", "text": "Eine Kundennummer ist automatisch anonymisiert, weil kein Name draufsteht.", "correct": false },
            { "id": "w3", "text": "Wenn Re-Identifikation praktisch möglich ist, sind es eher keine anonymisierten Daten.", "correct": true },
            { "id": "w4", "text": "Anonymisierung ist ein Zielzustand; Pseudonyme können trotzdem personenbezogen bleiben.", "correct": true }
          ]
        }
      ],
      "solution": "Personenbezogene Daten: alles, was eine Person direkt oder indirekt identifizierbar macht (nicht nur Name/Adresse)."
    },
    {
      "id": "c04",
      "profile": "Ein Kunde schreibt: „Welche Daten habt ihr über mich gespeichert? Bitte gebt mir eine Kopie und erklärt, wofür ihr sie nutzt.“ Welches Betroffenenrecht ist das?",
      "tags": ["Betroffenenrechte", "Auskunft", "DSGVO"],
      "options": [
        {
          "id": "auskunftsrecht",
          "label": "Auskunftsrecht (Recht auf Auskunft)",
          "isCorrect": true,
          "whys": [
            { "id": "w1", "text": "Betroffene dürfen wissen, ob und welche personenbezogenen Daten verarbeitet werden.", "correct": true },
            { "id": "w2", "text": "Typisch: Kopie/Übersicht der Daten, Zwecke, Kategorien, Empfänger (je nach Kontext).", "correct": true },
            { "id": "w3", "text": "Das ist das Recht auf Löschung, weil alle Daten sofort entfernt werden müssen.", "correct": false },
            { "id": "w4", "text": "Es geht um Transparenz: „Was habt ihr, warum, wie lange, wohin?“", "correct": true }
          ]
        },
        {
          "id": "berichtigung",
          "label": "Recht auf Berichtigung",
          "isCorrect": false,
          "whys": [
            { "id": "w1", "text": "Berichtigung greift, wenn Daten falsch/unvollständig sind und korrigiert werden sollen.", "correct": true },
            { "id": "w2", "text": "Hier wird primär Information/Kopie verlangt, nicht Korrektur.", "correct": true },
            { "id": "w3", "text": "Berichtigung ist identisch mit Auskunft: gleiche Anfrage, gleicher Zweck.", "correct": false },
            { "id": "w4", "text": "Ein Auskunftsersuchen kann anschließend Berichtigungen auslösen, ist aber nicht dasselbe.", "correct": true }
          ]
        }
      ],
      "solution": "Auskunftsrecht: Betroffene dürfen erfahren, welche Daten verarbeitet werden und wofür (inkl. Kopie/Info je nach Anfrage)."
    },
    {
      "id": "c05",
      "profile": "Ein Nutzer sagt: „Bitte löscht mein Konto und alle Daten. Ich habe den Dienst gekündigt, der Zweck ist weg.“ Welches Betroffenenrecht passt am besten?",
      "tags": ["Betroffenenrechte", "Löschung", "Zweckbindung"],
      "options": [
        {
          "id": "loeschung",
          "label": "Recht auf Löschung (\"Recht auf Vergessenwerden\")",
          "isCorrect": true,
          "whys": [
            { "id": "w1", "text": "Wenn der Zweck der Verarbeitung entfällt, kann Löschung grundsätzlich verlangt werden.", "correct": true },
            { "id": "w2", "text": "Das gilt nicht grenzenlos: Aufbewahrungspflichten (z. B. steuerlich) können entgegenstehen.", "correct": true },
            { "id": "w3", "text": "Löschung ist immer sofort und ohne Ausnahme Pflicht, egal welche Gesetze gelten.", "correct": false },
            { "id": "w4", "text": "Prüfungslogik: Zweck weg → Löschung prüfen; Pflichten/Interessen abwägen.", "correct": true }
          ]
        },
        {
          "id": "datenuebertragbarkeit",
          "label": "Recht auf Datenübertragbarkeit",
          "isCorrect": false,
          "whys": [
            { "id": "w1", "text": "Datenübertragbarkeit zielt auf Herausgabe in einem gängigen Format, nicht auf Löschen.", "correct": true },
            { "id": "w2", "text": "Hier wird eindeutig Entfernung der Daten gefordert.", "correct": true },
            { "id": "w3", "text": "Datenübertragbarkeit bedeutet, dass alle Daten automatisch gelöscht werden.", "correct": false },
            { "id": "w4", "text": "Portabilität kann ergänzend relevant sein, ist aber nicht der Kern der Anfrage.", "correct": true }
          ]
        }
      ],
      "solution": "Recht auf Löschung: bei weggefallenem Zweck grundsätzlich möglich, aber Ausnahmen wie gesetzliche Aufbewahrungspflichten beachten."
    },
    {
      "id": "c06",
      "profile": "Ein Nutzer möchte seine Daten zu einem anderen Anbieter mitnehmen: „Gebt mir meine Daten in einem maschinenlesbaren Format, damit ich wechseln kann.“ Welches Betroffenenrecht ist das?",
      "tags": ["Betroffenenrechte", "Portabilität", "Wechsel"],
      "options": [
        {
          "id": "datenuebertragbarkeit",
          "label": "Recht auf Datenübertragbarkeit",
          "isCorrect": true,
          "whys": [
            { "id": "w1", "text": "Ziel ist: Daten in einem gängigen, maschinenlesbaren Format erhalten und mitnehmen.", "correct": true },
            { "id": "w2", "text": "Typisch beim Anbieterwechsel (z. B. Export von Profil-/Nutzungsdaten).", "correct": true },
            { "id": "w3", "text": "Das ist das Recht auf Berichtigung, weil Daten sonst falsch wären.", "correct": false },
            { "id": "w4", "text": "Es geht um Herausgabe/Übertragung, nicht um Löschung oder reine Auskunft.", "correct": true }
          ]
        },
        {
          "id": "einschraenkung",
          "label": "Recht auf Einschränkung der Verarbeitung",
          "isCorrect": false,
          "whys": [
            { "id": "w1", "text": "Einschränkung bedeutet: Verarbeitung vorübergehend begrenzen (z. B. bei Streit über Richtigkeit).", "correct": true },
            { "id": "w2", "text": "Das löst nicht automatisch den Wunsch nach Export/Wechsel.", "correct": true },
            { "id": "w3", "text": "Einschränkung ist das Standardrecht, um Daten in maschinenlesbarer Form zu erhalten.", "correct": false },
            { "id": "w4", "text": "Für „Daten mitnehmen“ ist Portabilität die passendere Schublade.", "correct": true }
          ]
        }
      ],
      "solution": "Datenübertragbarkeit: Datenexport in gängigem, maschinenlesbarem Format für Anbieterwechsel."
    }
  ]
}
