{
  "game_type": "matching_puzzle",
  "title": "Verständnis der Fachbegriffe (QM) – Matching",
  "schema_version": "1.0",
  "subtitle": "Ziel: Ordne jeden Begriff der passenden Kurzbeschreibung und einem typischen Praxisbeispiel zu.",
  "columnTitles": {
    "column1": "Begriff",
    "column2": "Kurzbeschreibung",
    "column3": "Praxisbeispiel"
  },
  "columnHints": {
    "column1": "Wähle den passenden Begriff.",
    "column2": "Wähle die richtige Definition.",
    "column3": "Ordne ein realistisches Beispiel zu."
  },
  "sets": [
    {
      "id": "iso9000_qualitaetsbegriff",
      "name": "Qualitätsbegriff nach ISO 9000",
      "description": "Qualität = Grad, in dem ein Satz inhärenter Merkmale Anforderungen erfüllt (Anforderungen = Bedarf/Erwartung, festgelegt oder vorausgesetzt).",
      "example": "Ein Ticket-System gilt als „hochwertig“, wenn es die vereinbarten Anforderungen erfüllt: z. B. Antwortzeit, Verfügbarkeit, Rollen, Protokollierung."
    },
    {
      "id": "qm_systeme",
      "name": "Betriebliche QM-Systeme",
      "description": "Organisierte Regeln, Prozesse und Verantwortlichkeiten, um Qualität zu planen, zu steuern und kontinuierlich zu verbessern.",
      "example": "Das Unternehmen nutzt definierte Prozesse für Change/Release, Reviews, Tests und Dokumentation inklusive Rollen, Vorlagen und KPIs."
    },
    {
      "id": "qs_normen",
      "name": "QS-Normen",
      "description": "Normen/Standards, die Anforderungen an Qualitätssicherung und Prozesse definieren (z. B. Vorgaben für Dokumentation, Prüfungen, Nachweise).",
      "example": "Für Software-Entwicklung werden Testnachweise, Review-Protokolle und nachvollziehbare Freigaben nach einem Standard verlangt."
    },
    {
      "id": "audit",
      "name": "Audit",
      "description": "Systematische Prüfung, ob Prozesse/Regeln eingehalten werden und wirksam sind (intern oder extern, nach festen Kriterien).",
      "example": "Im internen Audit wird geprüft, ob Changes nur mit Ticket, Risikoabschätzung, Testnachweis und Freigabe in Produktion gehen."
    },
    {
      "id": "zertifizierung",
      "name": "Zertifizierung",
      "description": "Offizielle Bestätigung durch eine unabhängige Stelle, dass ein System/Prozess/Produkt definierte Normanforderungen erfüllt.",
      "example": "Nach erfolgreichem externem Audit erhält das Unternehmen ein Zertifikat, z. B. dass das QM-System die Anforderungen einer Norm erfüllt."
    }
  ]
}
