{
  "game_type": "matching_puzzle",
  "title": "IT-Systeme konzeptionieren – Matching",
  "schema_version": "1.0",
  "subtitle": "Ziel: Kombiniere jeweils den passenden Begriff aus der Systemkonzeption mit der richtigen Kurzbeschreibung und einem typischen Praxisbeispiel.",
  "columnTitles": {
    "column1": "Begriff/Artefakt",
    "column2": "Kurzbeschreibung",
    "column3": "Praxisbeispiel"
  },
  "columnHints": {
    "column1": "Wähle einen Begriff aus Analyse, Dokumentation oder Umsetzung.",
    "column2": "Wähle die passende Definition.",
    "column3": "Ordne ein realistisches Beispiel zu."
  },
  "sets": [
    {
      "id": "bedarfsanalyse",
      "name": "Bedarfsanalyse",
      "description": "Ermitteln von Anforderungen und Rahmenbedingungen (Zielgruppe, Use Cases, Muss/Soll, Budget, Risiken) als Basis für Entscheidungen.",
      "example": "Für neue Büro-PCs wird erhoben: genutzte Anwendungen, Monitorbedarf, Homeoffice-Anteil, Sicherheitsanforderungen und Budget pro Arbeitsplatz."
    },
    {
      "id": "lastenheft",
      "name": "Lastenheft",
      "description": "Was der Auftraggeber braucht: Ziele, Anforderungen und Randbedingungen aus Kundensicht, ohne technische Detail-Lösung.",
      "example": "Der Kunde fordert: „Büroarbeitsplatz mit 2 Monitoren, VPN-Zugang, Laufzeit 5 Jahre, Rollout ohne Betriebsunterbrechung“."
    },
    {
      "id": "pflichtenheft",
      "name": "Pflichtenheft",
      "description": "Wie der Auftragnehmer es umsetzt: technische Lösung, Komponenten, Konfiguration, Tests, Abnahme und Dokumentation.",
      "example": "Festgelegt wird: Windows 11, BitLocker, 16 GB RAM, SSD, Standard-Image, Domänenjoin, Rollout-Plan und Abnahmekriterien."
    },
    {
      "id": "os_installation",
      "name": "Installation: Betriebssysteme",
      "description": "Aufsetzen des OS inkl. Installationsmedium, Zielplatte wählen, Treiber/Updates, Basissicherheit und Standardsoftware.",
      "example": "Boot vom USB-Stick → Installation auf SSD → Treiberpaket → Updates → Domänenbeitritt → Office/Browser/AV."
    },
    {
      "id": "bios_uefi_setup",
      "name": "Konfiguration: BIOS/UEFI",
      "description": "Firmware-Einstellungen für Boot, Sicherheit und Hardware (z. B. Bootreihenfolge, Secure Boot, TPM, Virtualisierung, SATA-Modus).",
      "example": "Secure Boot und TPM werden aktiviert, Boot auf UEFI gestellt und Virtualisierung eingeschaltet für künftige VMs."
    },
    {
      "id": "partitionierung",
      "name": "Partitionierungen",
      "description": "Aufteilung eines Datenträgers in logische Bereiche (z. B. System, Daten, Recovery) passend zu OS und Einsatz.",
      "example": "Systempartition + Datenpartition werden getrennt, damit Nutzerdateien bei OS-Neuinstallation leichter erhalten bleiben."
    },
    {
      "id": "formatierung",
      "name": "Formatierungen",
      "description": "Anlegen eines Dateisystems auf einer Partition (z. B. NTFS, ext4) inkl. Cluster/Journaling-Optionen je nach Bedarf.",
      "example": "Windows-Client wird mit NTFS formatiert; Linux-Server-Datenpartition mit ext4 wegen Journaling."
    },
    {
      "id": "netzwerkanbindung",
      "name": "Netzwerk-Anbindungen",
      "description": "Einbindung ins Netz (LAN/WLAN/VLAN) inkl. Authentifizierung, Routing, DNS/DHCP und Sicherheitsvorgaben.",
      "example": "Client kommt in das Mitarbeiter-VLAN, erhält DHCP, DNS zeigt auf den Domain Controller und Firewall-Regeln greifen."
    },
    {
      "id": "ip_konfiguration",
      "name": "IP-Konfiguration",
      "description": "Festlegen von IP, Subnetz, Gateway und DNS (statisch oder per DHCP) für zuverlässige Kommunikation im Netz.",
      "example": "Server erhält statische IP, Clients bekommen DHCP; DNS wird auf interne Resolver gesetzt."
    },
    {
      "id": "remotedesktop",
      "name": "Remotedesktop",
      "description": "Fernzugriff auf Systeme (z. B. RDP/Remote-Tools) zur Administration oder Nutzerunterstützung, abgesichert über Rechte und Netzwerkzugang.",
      "example": "Support greift per RDP auf einen Client zu (nur aus Admin-Netz), um ein Treiberproblem live zu beheben."
    }
  ]
}
