{
  "game_type": "matching_puzzle",
  "title": "IT-Sicherheit auf Grundschutzniveau – Matching",
  "schema_version": "1.0",
  "subtitle": "Ziel: Kombiniere jeweils die passende Maßnahme oder den passenden Standard der Informationssicherheit mit der richtigen Kurzbeschreibung und einem typischen Praxisbeispiel.",
  "columnTitles": {
    "column1": "Maßnahme/Standard",
    "column2": "Kurzbeschreibung",
    "column3": "Praxisbeispiel"
  },
  "columnHints": {
    "column1": "Wähle eine organisatorische oder technische Maßnahme bzw. einen Standard.",
    "column2": "Wähle die passende Definition.",
    "column3": "Ordne ein realistisches Beispiel zu."
  },
  "sets": [
    {
      "id": "it_sicherheitsbeauftragter",
      "name": "IT-Sicherheitsbeauftragter",
      "description": "Benannte Rolle, die Informationssicherheit koordiniert, Maßnahmen nachhält und als Ansprechpartner für Security-Themen dient.",
      "example": "Der IT-Sicherheitsbeauftragte sammelt Risiken aus Projekten, pflegt Maßnahmenlisten und koordiniert Awareness-Schulungen."
    },
    {
      "id": "it_sicherheitsrichtlinie",
      "name": "IT-Sicherheitsrichtlinie",
      "description": "Verbindliche Regeln im Unternehmen zu Schutzmaßnahmen, Verantwortlichkeiten und Mindestanforderungen für IT-Nutzung und Betrieb.",
      "example": "In der Richtlinie steht: keine privaten USB-Sticks, Updates verpflichtend, Meldeweg bei Sicherheitsvorfällen."
    },
    {
      "id": "passwort_policy",
      "name": "Passwort-Policy",
      "description": "Regelwerk für sichere Authentifizierung (z. B. Mindestlänge, MFA, Sperrregeln, Passwortmanager, keine Wiederverwendung).",
      "example": "Accounts brauchen MFA, Passwörter mindestens 14 Zeichen, nach 10 Fehlversuchen wird der Login gesperrt."
    },
    {
      "id": "awareness",
      "name": "Security Awareness (Schulung)",
      "description": "Maßnahmen zur Sensibilisierung der Mitarbeitenden, um Fehlverhalten und Social Engineering zu reduzieren.",
      "example": "Phishing-Simulationen zeigen häufige Fallen; danach gibt es kurze Trainings mit konkreten Erkennungsmerkmalen."
    },
    {
      "id": "virenschutz",
      "name": "Virenschutzsystem (Endpoint Protection)",
      "description": "Schutz auf Clients/Servern gegen Malware durch Signaturen, Verhaltenserkennung, Quarantäne und zentrale Verwaltung.",
      "example": "Ein Trojaner wird beim Download blockiert; der Vorfall landet automatisch im Security-Console-Report."
    },
    {
      "id": "firewall",
      "name": "Firewall",
      "description": "Filtert Netzwerkverkehr nach Regeln, segmentiert Netze und reduziert Angriffsflächen (Inbound/Outbound, Ports, Anwendungen).",
      "example": "Nur Port 443 zum Webserver ist offen; Admin-Zugriff ist nur aus dem Admin-VLAN erlaubt."
    },
    {
      "id": "anti_spam",
      "name": "Anti-Spam / Mail-Security",
      "description": "Filtert unerwünschte oder gefährliche E-Mails (Spam, Phishing, Malware) über Regeln, Reputation und Inhaltsprüfung.",
      "example": "Eine Phishing-Mail wird in Quarantäne verschoben, weil Links zu einer bekannten Fake-Domain führen."
    },
    {
      "id": "patch_management",
      "name": "Patch- & Update-Management",
      "description": "Geplantes Einspielen von Updates für Betriebssysteme und Anwendungen, um Schwachstellen zu schließen und Stabilität zu sichern.",
      "example": "Clients bekommen monatliche Updates, kritische Patches werden innerhalb von 48 Stunden ausgerollt."
    },
    {
      "id": "iso_2700x",
      "name": "ISO 2700x (ISO/IEC 27001 ff.)",
      "description": "Internationale Normenfamilie für Informationssicherheitsmanagement (ISMS) mit Anforderungen und Best Practices.",
      "example": "Ein Unternehmen führt ein ISMS ein, definiert Risiken, Maßnahmen und prüft regelmäßig die Wirksamkeit."
    },
    {
      "id": "bsi_it_grundschutz",
      "name": "BSI IT-Grundschutz",
      "description": "Deutscher Standard mit Bausteinen, Maßnahmen und Vorgehen zur Absicherung auf definiertem Grundschutzniveau.",
      "example": "Für Server, Clients und Netze werden passende Bausteine ausgewählt und Maßnahmen wie Hardening, Backup und Rechtekonzept umgesetzt."
    }
  ]
}
