{
  "game_type": "matching_puzzle",
  "title": "Projekt- & Qualitätsmanagement (AP1) – Matching",
  "schema_version": "1.0",
  "subtitle": "Ziel: Kombiniere jeweils einen Begriff, die passende Kurzbeschreibung und ein realistisches Praxisbeispiel aus typischen AP1-Szenarien (Rollout, Tool-Auswahl, Feature-Entwicklung).",
  "columnTitles": {
    "column1": "Begriff / Methode",
    "column2": "Kurzbeschreibung",
    "column3": "Praxisbeispiel"
  },
  "columnHints": {
    "column1": "Wähle einen Begriff oder eine Methode.",
    "column2": "Wähle die passende Erklärung.",
    "column3": "Ordne ein typisches Beispiel aus der Praxis zu."
  },
  "sets": [
    {
      "id": "projekt_vs_prozess",
      "name": "Projekt vs. Prozess",
      "description": "Projekt: einmalig, zeitlich begrenzt, klares Ziel/Budget. Prozess: wiederkehrend, standardisiert, Dauerbetrieb.",
      "example": "Ticketbearbeitung ist Prozess; Einführung eines neuen Ticketsystems ist Projekt."
    },
    {
      "id": "projektauftrag",
      "name": "Projektauftrag",
      "description": "Startdokument: Ziel, Auftraggeber, grober Umfang, Ressourcen, Verantwortungen, Rahmenbedingungen.",
      "example": "Go-Live-Termin, Budgetlimit und grobe Lieferobjekte für einen Hardware-Rollout werden festgehalten."
    },
    {
      "id": "smart",
      "name": "SMART-Ziel",
      "description": "Spezifisch, Messbar, Akzeptiert, Realistisch, Terminiert – ohne SMART keine saubere Abnahme möglich.",
      "example": "Bis 31.03. ist das neue Ticketsystem für 45 Support-Mitarbeitende produktiv; 90% der Tickets laufen darüber."
    },
    {
      "id": "scope",
      "name": "Scope (Leistungsumfang)",
      "description": "Definiert, was Teil des Projekts ist und was ausdrücklich nicht – verhindert spätere Streitpunkte.",
      "example": "Im Projekt enthalten: Ticket-Workflow + Schulung. Nicht enthalten: Hardware-Erneuerung aller Clients."
    },
    {
      "id": "stakeholder",
      "name": "Stakeholder",
      "description": "Betroffene oder Interessierte, die Einfluss haben oder vom Ergebnis betroffen sind (intern/extern).",
      "example": "Fachabteilung, IT-Betrieb, Management, Key-User und ggf. Betriebsrat bei Personalsoftware."
    },
    {
      "id": "kommunikationsplan",
      "name": "Kommunikationsplan",
      "description": "Regelt: Wer bekommt wann welche Infos über welchen Kanal – reduziert Gerüchte, Widerstand und Nachforderungen.",
      "example": "Management monatlich Status/Risiken, Fachabteilung wöchentlich Features/Schulung, alle Nutzer vor Go-Live FAQ."
    },
    {
      "id": "klassische_phasen",
      "name": "Klassisches Vorgehen: Projektphasen",
      "description": "Typischer Ablauf: Initialisierung → Planung → Durchführung → Abschluss (Übergabe + Lessons Learned).",
      "example": "Nach Umsetzung folgt Abnahme, Übergabedoku und ein kurzes Review: Was lief gut, was nicht?"
    },
    {
      "id": "wasserfall",
      "name": "Wasserfallmodell",
      "description": "Lineares Vorgehen mit klaren Phasen, geeignet bei stabilen Anforderungen.",
      "example": "Standardisierter Hardware-Rollout: Analyse → Planung → Umsetzung → Test → Einführung."
    },
    {
      "id": "agil",
      "name": "Agiles Vorgehen",
      "description": "Iterativ in kurzen Zyklen, Feedback-getrieben; Planung passiert häufiger und kleinteiliger.",
      "example": "Web-App-Feature wird sprintweise gebaut und nach jedem Review anhand Nutzerfeedback angepasst."
    },
    {
      "id": "v_modell",
      "name": "V-Modell",
      "description": "Zu jeder Spezifikationsstufe gehört eine passende Teststufe: Was du definierst, musst du testbar machen.",
      "example": "Anforderungen ↔ Abnahmetest, Systemdesign ↔ Systemtest, Komponentendesign ↔ Integrationstest, Code ↔ Unit-Test."
    },
    {
      "id": "scrum_rollen",
      "name": "Scrum: Rollen",
      "description": "Product Owner (Was/Priorisierung), Scrum Master (Prozess/Blocker), Team (liefert Inkrement).",
      "example": "PO priorisiert Ticketsystem-Features, Scrum Master räumt Hindernisse aus dem Weg, Team liefert Sprint-Ergebnis."
    },
    {
      "id": "scrum_artefakte",
      "name": "Scrum: Artefakte",
      "description": "Product Backlog (alles), Sprint Backlog (Sprint-Auswahl), Increment (nutzbares Ergebnis).",
      "example": "Für Sprint 3 werden 8 Backlog-Items gewählt; am Ende steht ein lauffähiger Workflow inkl. Tests."
    },
    {
      "id": "scrum_events",
      "name": "Scrum: Ablauf/Events",
      "description": "Sprint (Zeitbox), Daily (Kurzabgleich), Review (Ergebnis+Feedback), Retrospektive (Prozess verbessern).",
      "example": "Im Review zeigt das Team den neuen Ticket-Statusfluss, Stakeholder geben Feedback, dann Retrospektive."
    },
    {
      "id": "kanban_wip",
      "name": "Kanban & WIP-Limit",
      "description": "Board visualisiert Flow; WIP-Limit begrenzt parallele Arbeit, erzwingt Fokus und senkt Durchlaufzeit.",
      "example": "Spalte „In Arbeit“ hat WIP=3: Erst wenn ein Ticket fertig ist, darf ein neues gestartet werden."
    },
    {
      "id": "psp",
      "name": "Projektstrukturplan (PSP)",
      "description": "Zerlegt das Projekt hierarchisch in Arbeitspakete; Basis für Aufwand, Zeit, Kosten und Verantwortlichkeiten.",
      "example": "Ticketsystem-Projekt: Analyse, Konfiguration, Migration, Schulung, Go-Live, Nachbetreuung – jeweils Arbeitspakete."
    },
    {
      "id": "arbeitspaket",
      "name": "Arbeitspaket",
      "description": "Kleines, klar abgrenzbares Paket mit messbarem Ergebnis, Verantwortlichem und Zeitrahmen.",
      "example": "„Benutzer-Login implementieren und Unit-Tests schreiben“ statt nur „Implementierung“."
    },
    {
      "id": "dreipunkt_schaetzung",
      "name": "Drei-Punkt-Schätzung",
      "description": "Optimistisch, realistisch, pessimistisch – liefert eine Bandbreite statt Fantasiezahl.",
      "example": "Migration: 2 Tage (best case), 4 Tage (normal), 7 Tage (worst case) wegen Zugängen/Abhängigkeiten."
    },
    {
      "id": "meilenstein",
      "name": "Meilenstein",
      "description": "Wichtiger Kontrollpunkt ohne eigene Dauer; markiert Entscheidung/Abnahme/Übergang.",
      "example": "„Abnahme abgeschlossen“ als Meilenstein vor dem Go-Live."
    },
    {
      "id": "abhaengigkeiten",
      "name": "Abhängigkeiten",
      "description": "Beziehungen zwischen Tasks (z. B. Ende-Start, Start-Start) bestimmen Reihenfolge und Planlogik.",
      "example": "Schulung erst nach Freigabe des finalen Workflows; Go-Live erst nach bestandenem Systemtest."
    },
    {
      "id": "kritischer_pfad",
      "name": "Kritischer Pfad",
      "description": "Längste Kette abhängiger Aufgaben; bestimmt die Mindestprojektdauer – Verzögerung dort verzögert alles.",
      "example": "Lieferung Hardware → Installation → Migration → Systemtest → Abnahme: hängt eine Aufgabe, rutscht der Go-Live."
    },
    {
      "id": "risiko",
      "name": "Risiko",
      "description": "Unsicheres Ereignis mit negativer Auswirkung; bewerten über Eintrittswahrscheinlichkeit × Auswirkung.",
      "example": "Lieferverzug (hoch/mittel) gefährdet Terminplan – wird bewertet und in die Planung aufgenommen."
    },
    {
      "id": "risikostrategien",
      "name": "Risikostrategien",
      "description": "Vermeiden, Reduzieren, Übertragen, Akzeptieren – und immer mit konkreter Maßnahme.",
      "example": "Datenverlust: Reduzieren durch getestetes Backup + Rollback-Plan; Lieferverzug: alternative Lieferanten."
    },
    {
      "id": "change_request",
      "name": "Change Request",
      "description": "Formale Änderung an Umfang/Zeit/Kosten mit Bewertung (Nutzen, Aufwand, Risiko) und Freigabe.",
      "example": "Neuer Report im Ticketsystem: Aufwand+Risiko prüfen, dann entscheiden, ob in Sprint/Release aufgenommen."
    },
    {
      "id": "scope_creep",
      "name": "Scope Creep",
      "description": "Schleichende Erweiterung ohne Planung/Mehrbudget – kippt Zeit und Kosten unbemerkt.",
      "example": "„Nur noch schnell“ zusätzliches Rechtekonzept + 3 Schnittstellen: am Ende platzt der Termin."
    },
    {
      "id": "qualitaet_iso9000",
      "name": "Qualität (ISO 9000-Denke)",
      "description": "Qualität = Anforderungen/Erwartungen messbar erfüllen – nicht „schön“ oder „perfekt“.",
      "example": "„Ticket wird in < 30 Min reagiert“ ist Qualitätsanforderung; „sieht gut aus“ bringt nichts Messbares."
    },
    {
      "id": "iso9001",
      "name": "ISO 9001",
      "description": "Anforderungen an ein QM-System: Prozesse dokumentieren, messen, auditierbar verbessern.",
      "example": "Für den Support existieren dokumentierte Abläufe, Audit-Nachweise und Maßnahmen zur Verbesserung."
    },
    {
      "id": "pdca",
      "name": "PDCA-Zyklus",
      "description": "Plan → Do → Check → Act: Ohne Check keine Daten, ohne Act keine Standardisierung.",
      "example": "Neuer Ticket-Workflow: planen, pilotieren, Kennzahlen prüfen, dann als Standard ausrollen."
    },
    {
      "id": "tqm",
      "name": "TQM (Total Quality Management)",
      "description": "Qualität als Kultur: Aufgabe aller, kundenorientiert, präventiv statt Fehler nur hinten raus finden.",
      "example": "Team nutzt Reviews, klare Definition-of-Done und kontinuierliche Verbesserung statt „testen wir später“."
    },
    {
      "id": "produkt_vs_prozessqualitaet",
      "name": "Produktqualität vs. Prozessqualität",
      "description": "Produktqualität: Ergebnis (funktioniert, sicher, nutzbar). Prozessqualität: Weg dahin (Reviews, Standards, Tests).",
      "example": "Produkt: Feature ist sicher und stabil. Prozess: Code-Review + Testplan + Doku wurden sauber durchgeführt."
    },
    {
      "id": "qualitaetssicherung",
      "name": "Qualitätssicherung",
      "description": "Konkrete Maßnahmen wie Reviews, Tests, Standards – je später Fehler gefunden werden, desto teurer.",
      "example": "Unit-Tests + Integrationstests laufen in CI; Peer-Review ist Pflicht vor Merge."
    },
    {
      "id": "teststufen",
      "name": "Teststufen",
      "description": "Unit → Integration → System → Abnahme; jede Stufe hat anderen Fokus und andere Verantwortliche.",
      "example": "Unit: einzelne Funktion, Integration: Module zusammen, System: Gesamt, Abnahme: Kunde bestätigt Anforderungen."
    },
    {
      "id": "vier_augen",
      "name": "4-Augen-Prinzip (Review)",
      "description": "Peer-Review findet Fehler früh, bevor sie in Betrieb gehen; erhöht Nachweisbarkeit und Qualität.",
      "example": "Konfig-Änderungen am Firewall-Rule-Set werden von zweiter Person geprüft und protokolliert."
    },
    {
      "id": "standards_dod",
      "name": "Standards & Definition of Done",
      "description": "Regeln machen Qualität messbar: Coding-Guidelines, Doku-Pflicht, DoD-Kriterien für „fertig“.",
      "example": "Done erst, wenn Tests grün, Doku aktualisiert, Security-Check erfüllt und Review abgeschlossen ist."
    },
    {
      "id": "dokumentation",
      "name": "Dokumentation & Nachweisbarkeit",
      "description": "Was nicht dokumentiert ist, gilt als nicht passiert: Entscheidungen, Tests, Abnahme, Risiken, Übergabe.",
      "example": "Projekt hat Protokolle, Testprotokolle, Abnahmebericht, Übergabedoku und Lessons Learned."
    }
  ]
}
