{
  "game_type": "matching_puzzle",
  "title": "Leistungsfähigkeit & Energieeffizienz – Matching",
  "schema_version": "1.0",
  "subtitle": "Ziel: Kombiniere jeweils den passenden Begriff rund um Performance, Standards und Energieeffizienz mit der richtigen Kurzbeschreibung und einem typischen Praxisbeispiel.",
  "columnTitles": {
    "column1": "Begriff/Kenngröße",
    "column2": "Kurzbeschreibung",
    "column3": "Praxisbeispiel"
  },
  "columnHints": {
    "column1": "Wähle einen Begriff aus Hardware, Netzwerk, Standards oder Energie.",
    "column2": "Wähle die passende Definition.",
    "column3": "Ordne ein realistisches Beispiel zu."
  },
  "sets": [
    {
      "id": "kenngroessen_leistung",
      "name": "Kenngrößen & Leistungsdaten",
      "description": "Messwerte zur Einordnung der Systemleistung (z. B. Kerne/Threads, Takt, RAM-Größe, Storage-IOPS, Durchsatz, Latenz).",
      "example": "Ein PC wirkt langsam: Messung zeigt hohe Datenträger-Auslastung und geringe IOPS → SSD-Upgrade bringt mehr als CPU-Tausch."
    },
    {
      "id": "funktionsumfang",
      "name": "Funktionsumfang",
      "description": "Welche Features ein System bietet (z. B. Secure Boot, RAID-Unterstützung, Netzwerkstandards, Verschlüsselung, Management).",
      "example": "Für einen Firmenclient ist wichtig: TPM/Secure Boot, BitLocker-Unterstützung und zentral verwaltbare BIOS/UEFI-Settings."
    },
    {
      "id": "bios",
      "name": "BIOS",
      "description": "Klassische Firmware-Grundsoftware zum Starten des PCs; bietet Basis-Setup, ist aber funktional begrenzter als UEFI.",
      "example": "Ein Installationsstick bootet nicht, weil das System auf Legacy/BIOS steht, das Medium aber UEFI erwartet."
    },
    {
      "id": "uefi",
      "name": "UEFI",
      "description": "Moderne Firmware mit erweiterten Funktionen (z. B. Secure Boot, bessere Bootverwaltung, oft GPT-freundlich).",
      "example": "Ein Rechner startet schneller und sicherer, weil UEFI + Secure Boot aktiv sind und von GPT gebootet wird."
    },
    {
      "id": "cpu",
      "name": "CPU",
      "description": "Rechenleistung hängt u. a. von Kernen/Threads, Takt, Cache und Architektur ab; bestimmt stark die Ausführungszeit CPU-lastiger Aufgaben.",
      "example": "Beim Kompilieren mehrerer Projekte bringt eine CPU mit mehr Kernen deutlich kürzere Build-Zeiten."
    },
    {
      "id": "ram",
      "name": "RAM",
      "description": "Arbeitsspeicher für laufende Programme; zu wenig RAM führt zu Auslagerung auf Datenträger und macht Systeme träge.",
      "example": "Mit 8 GB RAM ruckelt die VM ständig; mit 16 GB läuft sie stabil ohne permanentes Swapping."
    },
    {
      "id": "datenspeicher",
      "name": "Datenspeicher (SSD/HDD/NVMe)",
      "description": "Massenspeicher für Daten; Performance wird u. a. durch Durchsatz und Zugriffszeiten/IOPS bestimmt.",
      "example": "Umstieg von HDD auf NVMe-SSD reduziert Boot- und Ladezeiten massiv, obwohl CPU und RAM gleich bleiben."
    },
    {
      "id": "raid",
      "name": "RAID",
      "description": "Zusammenschluss mehrerer Datenträger für Performance und/oder Ausfallsicherheit (je nach RAID-Level).",
      "example": "Ein Fileserver nutzt RAID 1 für Spiegelung: eine Platte fällt aus, der Betrieb läuft weiter, Austausch ohne Downtime."
    },
    {
      "id": "dateisysteme",
      "name": "Dateisysteme",
      "description": "Regeln, wie Daten auf einem Datenträger organisiert werden (z. B. NTFS, ext4); beeinflusst Features wie Rechte, Journaling, Limits.",
      "example": "Auf einem Linux-Server wird ext4 genutzt, weil es stabil ist und Journaling bei Abstürzen hilft."
    },
    {
      "id": "lwl",
      "name": "LWL (Lichtwellenleiter)",
      "description": "Glasfaser als Übertragungsmedium; hohe Bandbreiten und große Distanzen, unempfindlich gegen elektromagnetische Störungen.",
      "example": "Zwischen zwei Gebäuden wird LWL genutzt, weil Kupfer zu lang wäre und Störungen durch Maschinen drohen."
    },
    {
      "id": "ethernet_standards",
      "name": "Ethernet-Standards",
      "description": "Kabelgebundene Netzwerkstandards (z. B. 1 Gbit/s, 10 Gbit/s) mit definierter Geschwindigkeit und Medienanforderungen.",
      "example": "Ein NAS bekommt 10-Gbit-Ethernet, weil 1 Gbit/s beim Backup-Fenster zu langsam ist."
    },
    {
      "id": "wlan_standards",
      "name": "WLAN-Standards",
      "description": "Funkstandards nach IEEE 802.11 mit unterschiedlichen Datenraten, Frequenzbändern und Effizienz (z. B. 802.11ac/ax).",
      "example": "Im Schulungsraum wird auf neuere WLAN-APs umgestellt, weil viele Clients gleichzeitig stabile Bandbreite brauchen."
    },
    {
      "id": "ce_kennzeichnung",
      "name": "CE-Kennzeichnung",
      "description": "Kennzeichnung, dass ein Produkt grundlegende EU-Anforderungen (z. B. Sicherheit/EMV) erfüllt und in der EU in Verkehr gebracht werden darf.",
      "example": "Beim Einkauf für die Firma wird auf CE geachtet, damit Geräte regulär und rechtskonform eingesetzt werden können."
    },
    {
      "id": "rohs",
      "name": "RoHS",
      "description": "Vorgaben zur Beschränkung gefährlicher Stoffe in Elektro-/Elektronikgeräten; relevant bei Beschaffung und Entsorgung.",
      "example": "Beim Austausch von Hardware wird bevorzugt RoHS-konforme Ware beschafft, um Compliance einzuhalten."
    },
    {
      "id": "waste_weee",
      "name": "WEEE/Elektro-Entsorgung (Symbol Mülltonne)",
      "description": "Kennzeichnung/Regelwerk, dass Elektrogeräte getrennt entsorgt werden müssen; unterstützt korrekte Rücknahme und Recycling.",
      "example": "Altgeräte werden nicht in den Restmüll gegeben, sondern über den Entsorgungsprozess der Firma abgewickelt."
    },
    {
      "id": "80_plus",
      "name": "80 PLUS (Netzteil-Effizienz)",
      "description": "Effizienz-Klassifizierung von PC-Netzteilen; höhere Effizienz bedeutet weniger Verlustwärme bei gleicher Abgabeleistung.",
      "example": "Ein effizienteres Netzteil reduziert Stromkosten und Hitze im Gehäuse, besonders bei Dauerbetrieb."
    },
    {
      "id": "wirkungsgrad",
      "name": "Wirkungsgrad (η)",
      "description": "Verhältnis von nutzbarer Leistung zu aufgenommener Leistung; Verluste werden meist als Wärme abgegeben.",
      "example": "Ein Netzteil mit höherem η braucht weniger Eingangsleistung für die gleiche PC-Last und wird dabei weniger heiß."
    },
    {
      "id": "leistung_p_u_i",
      "name": "Leistung: P = U · I",
      "description": "Elektrische Leistung P ergibt sich aus Spannung U und Strom I (Grundformel zur Leistungsberechnung).",
      "example": "230 V und 0,5 A → P = 115 W: So lässt sich überschlagen, was ein Gerät ungefähr zieht."
    },
    {
      "id": "energie_w_p_t",
      "name": "Energie/Arbeit: W = P · t",
      "description": "Energieverbrauch ergibt sich aus Leistung mal Zeit; typisch in Wh/kWh (bei t in Stunden).",
      "example": "Ein PC mit 100 W läuft 2 Stunden: W = 200 Wh = 0,2 kWh."
    },
    {
      "id": "leistungsaufnahme",
      "name": "Leistungsaufnahme",
      "description": "Momentane elektrische Leistung, die ein Gerät gerade zieht (Watt); variiert je nach Lastzustand (Idle/Last).",
      "example": "Unter Volllast zieht der Rechner 300 W, im Idle nur 70 W – relevant für Netzteilwahl und Stromkosten."
    }
  ]
}
