{
  "game_type": "matching_puzzle",
  "title": "Marktgängige Systeme – Matching",
  "schema_version": "1.0",
  "subtitle": "Ziel: Kombiniere jeweils den passenden System-/Produktbereich mit der richtigen Kurzbeschreibung und einem typischen Praxisbeispiel.",
  "columnTitles": {
    "column1": "System/Produktbereich",
    "column2": "Kurzbeschreibung",
    "column3": "Praxisbeispiel"
  },
  "columnHints": {
    "column1": "Wähle einen Bereich aus Hardware/Software/Virtualisierung/Cloud.",
    "column2": "Wähle die passende Definition.",
    "column3": "Ordne ein realistisches Beispiel zu."
  },
  "sets": [
    {
      "id": "hardwareprodukte",
      "name": "Hardwareprodukte",
      "description": "Physische Komponenten und Geräte eines IT-Systems (Rechenleistung, Speicher, Stromversorgung, Ein-/Ausgabe, Netzwerk).",
      "example": "Ein Büro-PC wird geplant mit CPU, Mainboard, 16 GB RAM, SSD, Netzteil, Grafikkarte, Monitor, Tastatur und LAN/WLAN."
    },
    {
      "id": "cpu",
      "name": "CPU (Prozessor)",
      "description": "Recheneinheit, die Programme ausführt; Leistung hängt u. a. von Kernen/Threads, Takt und Cache ab.",
      "example": "Für viele parallele Tasks wird ein Prozessor mit mehr Kernen gewählt, statt nur auf hohen Takt zu setzen."
    },
    {
      "id": "motherboard",
      "name": "Motherboard (Mainboard)",
      "description": "Zentrale Platine, die Komponenten verbindet (CPU-Sockel, RAM-Slots, PCIe, SATA/M.2, Chipsatz, Ports).",
      "example": "Beim Upgrade wird geprüft, ob das Board M.2-NVMe unterstützt und genug PCIe-Lanes für GPU und Netzwerkkarte bietet."
    },
    {
      "id": "speicher",
      "name": "Speicher (RAM/SSD/HDD)",
      "description": "RAM für laufende Programme (schnell, flüchtig) und Massenspeicher für Daten (SSD/HDD, dauerhaft).",
      "example": "Ein langsamer Rechner wird durch SSD und mehr RAM deutlich schneller, ohne die CPU zu tauschen."
    },
    {
      "id": "netzteil",
      "name": "Netzteil (PSU)",
      "description": "Versorgt Komponenten mit Strom; wichtig sind Leistung, Effizienz (z. B. 80 PLUS) und passende Anschlüsse.",
      "example": "Für eine neue Grafikkarte wird ein stärkeres Netzteil mit ausreichenden PCIe-Stromsteckern eingeplant."
    },
    {
      "id": "grafikkarte",
      "name": "Grafikkarte (GPU)",
      "description": "Spezialisierte Recheneinheit für Grafik und parallele Berechnungen; relevant für CAD, Video, KI, Gaming.",
      "example": "Für CAD-Arbeitsplätze wird eine professionelle GPU gewählt, um stabile Treiber und Performance zu bekommen."
    },
    {
      "id": "peripherie",
      "name": "Peripheriegeräte",
      "description": "Externe Ein-/Ausgabegeräte und Zubehör (Monitor, Tastatur, Maus, Drucker, Headset, Scanner).",
      "example": "Im Supportfall wird geprüft, ob der Drucker per USB oder Netzwerk angebunden ist und ob Treiber/Queue korrekt sind."
    },
    {
      "id": "netzwerkkomponenten",
      "name": "Netzwerkkomponenten",
      "description": "Geräte zur Datenübertragung und Segmentierung (Switch, Router, Firewall, Access Point, Kabel).",
      "example": "Ein VLAN wird am Switch konfiguriert und über die Firewall ins Internet geroutet, getrennt vom Gäste-WLAN."
    },
    {
      "id": "wlan",
      "name": "WLAN (Wireless LAN)",
      "description": "Funknetz nach IEEE 802.11; relevant sind Standards, Frequenzen (2,4/5/6 GHz), Sicherheit (WPA2/WPA3).",
      "example": "Ein Unternehmen migriert von WPA2-PSK auf WPA2/WPA3-Enterprise mit 802.1X, um Nutzer eindeutig zu authentifizieren."
    },
    {
      "id": "softwareprodukte",
      "name": "Softwareprodukte",
      "description": "Programme und Systeme, die auf Hardware laufen: Anwendungen (z. B. Office) und Betriebssysteme (z. B. Windows/Linux).",
      "example": "Für neue Geräte wird ein Standard-Image mit Betriebssystem, Treibern, Office und Sicherheitssoftware ausgerollt."
    },
    {
      "id": "betriebssysteme",
      "name": "Betriebssysteme",
      "description": "Basissoftware zur Verwaltung von Hardware, Prozessen, Dateien und Benutzern; Plattform für Anwendungen.",
      "example": "Ein Server läuft auf Linux für Webservices, Clients auf Windows für Office und Domänenanmeldung."
    },
    {
      "id": "virtualisierung",
      "name": "Virtualisierung",
      "description": "Abstraktion von Hardware, um mehrere virtuelle Systeme auf einem Host zu betreiben (VMs/Container).",
      "example": "Auf einem Host laufen drei VMs: Domain Controller, Fileserver und Monitoring – getrennt, aber auf derselben Hardware."
    },
    {
      "id": "cloud_saas",
      "name": "Cloud: SaaS",
      "description": "Software als fertiger Dienst; Anbieter betreibt alles, Kunde nutzt nur die Anwendung.",
      "example": "E-Mail wird als SaaS genutzt: Benutzerkonten verwalten, aber keine Server patchen oder betreiben."
    },
    {
      "id": "cloud_iaas",
      "name": "Cloud: IaaS",
      "description": "Infrastruktur als Dienst (VMs, Storage, Netzwerk); Kunde verwaltet Betriebssysteme und Anwendungen selbst.",
      "example": "Ein Webserver wird als VM in der Cloud betrieben; das Team patcht das OS und deployt die Anwendung."
    },
    {
      "id": "cloud_paas",
      "name": "Cloud: PaaS",
      "description": "Plattform als Dienst (Runtime, Datenbanken, App-Services); Kunde deployt Code, Anbieter betreibt Plattform und Skalierung.",
      "example": "Eine API läuft auf einer Managed Plattform; Logs, Scaling und Updates der Laufzeitumgebung kommen vom Anbieter."
    }
  ]
}
