{
  "game_type": "matching_puzzle",
  "title": "Bedarfsgerechte Softwareauswahl – Matching",
  "schema_version": "1.0",
  "subtitle": "Ziel: Kombiniere jeweils den passenden Begriff zur Softwareauswahl mit der richtigen Kurzbeschreibung und einem typischen Praxisbeispiel.",
  "columnTitles": {
    "column1": "Begriff/Kriterium",
    "column2": "Kurzbeschreibung",
    "column3": "Praxisbeispiel"
  },
  "columnHints": {
    "column1": "Wähle einen Begriff aus Softwarearten, Lizenzen oder Auswahlkriterien.",
    "column2": "Wähle die passende Definition.",
    "column3": "Ordne ein realistisches Beispiel zu."
  },
  "sets": [
    {
      "id": "anwendungssoftware",
      "name": "Anwendungssoftware",
      "description": "Programme, die konkrete Aufgaben der Nutzer unterstützen (z. B. Office, Browser, CRM, CAD, Ticketsystem).",
      "example": "Für die Buchhaltung wird eine Finanzsoftware ausgewählt, die DATEV-Export und revisionssichere Ablage unterstützt."
    },
    {
      "id": "betriebssysteme",
      "name": "Betriebssysteme",
      "description": "Basissoftware für Hardwareverwaltung und Ausführung von Anwendungen; beeinflusst Treiber, Sicherheit, Updates und Kompatibilität.",
      "example": "Für Domänenbetrieb wird Windows 11 Pro eingesetzt, für Webserver Linux wegen Stabilität und Paketverwaltung."
    },
    {
      "id": "ide",
      "name": "IDE (Integrierte Entwicklungsumgebung)",
      "description": "Entwicklungswerkzeug mit Editor, Build/Run, Debugger und oft Git/Tests, um Programmierung effizienter zu machen.",
      "example": "Das Team nutzt eine IDE mit Breakpoints und Refactoring, um Fehler schneller zu finden und Code sauber zu halten."
    },
    {
      "id": "standardsoftware",
      "name": "Standardsoftware",
      "description": "Fertiges Produkt für viele Kunden; meist schneller verfügbar, günstiger und durch Updates gepflegt.",
      "example": "Statt Eigenentwicklung wird ein etabliertes Ticketsystem genutzt, weil es Prozesse, SLAs und Reporting schon mitbringt."
    },
    {
      "id": "individualsoftware",
      "name": "Individualsoftware",
      "description": "Maßgeschneiderte Software für spezielle Anforderungen; mehr Flexibilität, aber höhere Kosten und Wartungsaufwand.",
      "example": "Eine spezielle Produktionssteuerung wird individuell entwickelt, weil Standardprodukte den Ablauf nicht abbilden können."
    },
    {
      "id": "branchensoftware",
      "name": "Branchensoftware",
      "description": "Spezialisierte Standardsoftware für eine bestimmte Branche mit typischen Funktionen und Schnittstellen (z. B. Arztpraxis, Handwerk).",
      "example": "Eine Kanzlei nutzt Branchensoftware mit Aktenführung, Fristenverwaltung und beA-Schnittstelle."
    },
    {
      "id": "open_source",
      "name": "Open Source",
      "description": "Quelloffene Software mit Lizenzbedingungen (z. B. GPL/MIT); bietet Transparenz und Anpassbarkeit, aber braucht klare Verantwortlichkeiten.",
      "example": "Ein Monitoring wird als Open Source eingeführt; Updates und Betrieb werden im Admin-Team fest verankert."
    },
    {
      "id": "proprietaer",
      "name": "Proprietäre Software",
      "description": "Software mit geschlossenem Quellcode und Herstellerbindung; oft mit Support/SLAs, aber abhängig von Lizenzmodell und Anbieter.",
      "example": "Ein ERP wird proprietär beschafft, weil garantierter Herstellersupport und Zertifizierungen gefordert sind."
    },
    {
      "id": "anpassbarkeit",
      "name": "Anpassbarkeit",
      "description": "Wie gut sich Software konfigurieren/erweitern lässt (Customizing, Plugins, Rollen/Rechte, Workflows) ohne Quellcodeänderung.",
      "example": "Das CRM wird über Workflows und Felder angepasst, statt eigene Sonderlogik zu programmieren."
    },
    {
      "id": "schnittstellen",
      "name": "Schnittstellen (APIs/Import/Export)",
      "description": "Möglichkeiten zur Integration mit anderen Systemen (REST, SOAP, CSV, SSO, Webhooks) für Datenaustausch und Automatisierung.",
      "example": "Das Ticketsystem muss eine API haben, um Monitoring-Alerts automatisch als Incidents anzulegen."
    },
    {
      "id": "kompatibilitaet",
      "name": "Kompatibilität",
      "description": "Zusammenspiel mit vorhandener Hardware/Software/Standards (OS-Versionen, Browser, Datenformate, Authentifizierung).",
      "example": "Eine neue Videokonferenzlösung wird gewählt, weil sie auf verwalteten Clients läuft und SSO via Entra ID unterstützt."
    },
    {
      "id": "bewertungskriterien",
      "name": "Bewertungskriterien (Fit-Gap)",
      "description": "Abgleich von Anforderungen mit Produktfunktionen: passt es (Fit) oder fehlen kritische Punkte (Gap) → Entscheidung/Alternativen.",
      "example": "Pflichtkriterium „Mandantenfähigkeit“ fehlt → Produkt fällt raus, obwohl es sonst günstig wäre."
    }
  ]
}
