{
  "game_type": "matching_puzzle",
  "title": "Urheberrechtsgesetz und Lizenzmodelle – Matching",
  "schema_version": "1.0",
  "subtitle": "Ziel: Ordne jeden Begriff der passenden Kurzbeschreibung und einem typischen Praxisbeispiel zu.",
  "columnTitles": {
    "column1": "Begriff",
    "column2": "Kurzbeschreibung",
    "column3": "Praxisbeispiel"
  },
  "columnHints": {
    "column1": "Wähle den passenden Begriff.",
    "column2": "Wähle die richtige Definition.",
    "column3": "Ordne ein realistisches Beispiel zu."
  },
  "sets": [
    {
      "id": "urheberrechtsgesetz",
      "name": "Urheberrechtsgesetz (UrhG)",
      "description": "Regelt Schutz und Nutzung von Werken (z. B. Software, Texte, Bilder) und legt fest, was ohne Erlaubnis nicht genutzt werden darf.",
      "example": "Ein Bild aus dem Internet darf nicht einfach in eine Firmenpräsentation kopiert werden, wenn keine Lizenz oder Erlaubnis vorliegt."
    },
    {
      "id": "eula",
      "name": "Lizenzart: EULA",
      "description": "Endnutzer-Lizenzvertrag: legt fest, wie Software genutzt werden darf (z. B. Anzahl Geräte/User, Verbot von Weitergabe/Reverse Engineering).",
      "example": "Eine Software darf laut EULA nur auf einem Gerät installiert werden und nicht an Dritte weitergegeben werden."
    },
    {
      "id": "oem",
      "name": "Lizenzart: OEM",
      "description": "Lizenz, die an ein bestimmtes Gerät/Hardware gebunden ist und meist nur mit diesem verkauft/übertragen werden darf.",
      "example": "Windows ist als OEM-Lizenz auf einem Laptop vorinstalliert und kann nicht legal auf einen anderen PC umgezogen werden."
    },
    {
      "id": "gnu",
      "name": "Lizenzart: GNU (z. B. GPL/LGPL)",
      "description": "Open-Source-Lizenzfamilie mit Bedingungen, z. B. Weitergabe von Quellcode bei Verteilung abgeleiteter Werke (Copyleft, je nach Variante).",
      "example": "Eine Firma passt GPL-Software an und verteilt sie an Kunden – dann muss sie auch den Quellcode der Änderungen bereitstellen."
    },
    {
      "id": "pay_by_use",
      "name": "Pay by Use",
      "description": "Nutzungsabhängiges Abrechnungsmodell: Kosten entstehen je nach Verbrauch (z. B. pro User, pro Anfrage, pro Stunde, pro GB).",
      "example": "Eine Cloud-Datenbank wird pro Anfrage und Speicherverbrauch abgerechnet; bei wenig Nutzung sinken die monatlichen Kosten."
    }
  ]
}
