{
  "game_type": "matching_puzzle",
  "title": "Kriterien der Softwarequalität – Matching",
  "schema_version": "1.0",
  "subtitle": "Ziel: Ordne jedes Qualitätskriterium der passenden Kurzbeschreibung und einem typischen Praxisbeispiel zu.",
  "columnTitles": {
    "column1": "Kriterium",
    "column2": "Kurzbeschreibung",
    "column3": "Praxisbeispiel"
  },
  "columnHints": {
    "column1": "Wähle das passende Qualitätskriterium.",
    "column2": "Wähle die richtige Bedeutung.",
    "column3": "Ordne ein realistisches Beispiel zu."
  },
  "sets": [
    {
      "id": "funktionalitaet",
      "name": "Funktionalität",
      "description": "Erfüllt die Software die geforderten Funktionen korrekt und vollständig?",
      "example": "Die Suche findet Treffer korrekt, Filter funktionieren, und das Export-Feature erzeugt die vereinbarte CSV/PDF-Ausgabe."
    },
    {
      "id": "zuverlaessigkeit",
      "name": "Zuverlässigkeit",
      "description": "Läuft die Software stabil und liefert auch unter Störungen/Last verlässliche Ergebnisse (Fehlertoleranz, Verfügbarkeit)?",
      "example": "Auch bei hoher Nutzerzahl stürzt das System nicht ab und verarbeitet Anfragen ohne Datenverlust."
    },
    {
      "id": "benutzbarkeit",
      "name": "Benutzbarkeit",
      "description": "Ist die Software leicht zu verstehen, zu erlernen und effizient zu bedienen (Usability, Barrierefreiheit)?",
      "example": "Neue Nutzer finden sich ohne Schulung zurecht, Eingabefehler werden verständlich angezeigt, Tastaturbedienung funktioniert."
    },
    {
      "id": "effizienz",
      "name": "Effizienz",
      "description": "Verbraucht die Software angemessen Ressourcen (CPU/RAM/Netz) und reagiert schnell genug?",
      "example": "Seiten laden in unter 2 Sekunden, Reports laufen in akzeptabler Zeit und der Server bleibt unter definierter Auslastung."
    },
    {
      "id": "aenderbarkeit",
      "name": "Änderbarkeit",
      "description": "Wie leicht kann die Software angepasst, erweitert und repariert werden (Wartbarkeit, Testbarkeit, klare Struktur)?",
      "example": "Ein neues Feld im Formular wird implementiert, ohne dass an 10 Stellen Code kopiert werden muss, weil die Logik sauber modular ist."
    },
    {
      "id": "uebertragbarkeit",
      "name": "Übertragbarkeit",
      "description": "Wie leicht lässt sich die Software in andere Umgebungen übertragen (OS, Plattform, Browser, Infrastruktur)?",
      "example": "Die App läuft sowohl on-prem als auch in der Cloud und funktioniert auf Windows und Linux ohne Codeänderungen."
    }
  ]
}
