{
  "game_type": "matching_puzzle",
  "title": "Leistungserbringung bewerten – Matching",
  "schema_version": "1.0",
  "subtitle": "Ziel: Kombiniere jeweils den passenden Begriff zur Bewertung der Leistungserbringung mit der richtigen Kurzbeschreibung und einem typischen Praxisbeispiel.",
  "columnTitles": {
    "column1": "Begriff/Methode",
    "column2": "Kurzbeschreibung",
    "column3": "Praxisbeispiel"
  },
  "columnHints": {
    "column1": "Wähle einen Begriff aus Bewertung, Analyse oder Verbesserung.",
    "column2": "Wähle die passende Definition.",
    "column3": "Ordne ein realistisches Beispiel zu."
  },
  "sets": [
    {
      "id": "bestaetigung_erbracht",
      "name": "Bestätigung erbrachter Leistungen",
      "description": "Formale Bestätigung, dass vereinbarte Leistungen geliefert wurden (z. B. Abnahme, Leistungsnachweis, Übergabeprotokoll).",
      "example": "Der Kunde unterschreibt das Abnahmeprotokoll für den seehrverfügbarkeit VPN-Rollout nach erfolgreich bestandenem Testkatalog."
    },
    {
      "id": "soll_ist_vergleich",
      "name": "Soll-Ist-Vergleich",
      "description": "Vergleich geplanter Vorgaben (Soll) mit tatsächlich erreichten Ergebnissen (Ist) bei Zeit, Kosten, Umfang und Qualität.",
      "example": "Soll: 10 PT, Ist: 13 PT; Soll: 99,5% Verfügbarkeit, Ist: 99,7% im ersten Betriebsmonat."
    },
    {
      "id": "abweichungsanalyse",
      "name": "Abweichungsanalyse",
      "description": "Untersuchung, warum Soll und Ist auseinanderliegen: Ursachen, Einflussfaktoren, Verantwortlichkeiten und Folgen.",
      "example": "Mehr Aufwand entstand durch fehlende Netzwerkdokumentation und zusätzliche Security-Anforderungen; Auswirkungen werden dokumentiert."
    },
    {
      "id": "lessons_learned",
      "name": "Lessons Learned",
      "description": "Systematische Reflexion nach Abschluss, um Erkenntnisse festzuhalten und Verbesserungen für künftige Projekte/Services abzuleiten.",
      "example": "Team beschließt: Risikoanalyse früher starten, Abhängigkeiten im Netzplan pflegen und Abnahmekriterien vor Umsetzung fixieren."
    },
    {
      "id": "kennzahlen_reporting",
      "name": "Kennzahlen & Reporting",
      "description": "Messgrößen zur Bewertung (z. B. Ticket-Lösungszeit, Fehlerquote, Verfügbarkeit) werden regelmäßig berichtet.",
      "example": "Monatsreport zeigt: durchschnittliche Lösungszeit sank von 2,5 auf 1,6 Tage nach Prozessanpassungen."
    },
    {
      "id": "massnahmenplan",
      "name": "Maßnahmenplan (Follow-up)",
      "description": "Konkrete To-dos aus Abweichungsanalyse/Lessons Learned mit Verantwortlichen und Terminen, damit Erkenntnisse umgesetzt werden.",
      "example": "Bis Ende Monat: Netzwerkdoku standardisieren (Owner: Betrieb), Restore-Tests quartalsweise verpflichtend (Owner: Security)."
    }
  ]
}
