{
  "game_type": "matching_puzzle",
  "title": "Marktsituationen bewerten – Matching",
  "schema_version": "1.0",
  "subtitle": "Ziel: Ordne jeden Begriff der passenden Kurzbeschreibung und einem typischen Praxisbeispiel zu.",
  "columnTitles": {
    "column1": "Begriff",
    "column2": "Kurzbeschreibung",
    "column3": "Praxisbeispiel"
  },
  "columnHints": {
    "column1": "Wähle den passenden Begriff.",
    "column2": "Wähle die richtige Definition.",
    "column3": "Ordne ein realistisches Beispiel zu."
  },
  "sets": [
    {
      "id": "monopol",
      "name": "Marktform: Monopol",
      "description": "Ein Anbieter dominiert den Markt; Kunden haben kaum Ausweichmöglichkeiten.",
      "example": "Ein regionaler Netzbetreiber ist der einzige Anbieter für einen bestimmten Glasfaseranschluss – Preis und Konditionen sind schwer verhandelbar."
    },
    {
      "id": "oligopol",
      "name": "Marktform: Oligopol",
      "description": "Wenige Anbieter teilen sich den Markt; Konkurrenz ist vorhanden, aber stark konzentriert.",
      "example": "Im Markt für große Cloud-Plattformen bestimmen wenige Anbieter die Standards, Preise und Ökosysteme."
    },
    {
      "id": "polypol",
      "name": "Marktform: Polypol",
      "description": "Viele Anbieter und viele Nachfrager; Preise und Leistungen sind stark wettbewerbsgetrieben.",
      "example": "Bei IT-Freelancern gibt es viele Anbieter – Stundensätze und Leistungen werden stark über Vergleich und Wettbewerb bestimmt."
    },
    {
      "id": "kaeufermarkt",
      "name": "Marktform: Käufermarkt",
      "description": "Angebot ist größer als Nachfrage; Käufer können stärker verhandeln und auswählen.",
      "example": "Bei Standard-Softwarelizenzen vergleichen Kunden mehrere Anbieter/Reseller und verhandeln Rabatte sowie bessere Konditionen."
    },
    {
      "id": "verkaeufermarkt",
      "name": "Marktform: Verkäufermarkt",
      "description": "Nachfrage ist größer als Angebot; Verkäufer bestimmen eher Preis und Lieferbedingungen.",
      "example": "Bei knappen Server-Komponenten sind Lieferzeiten lang – der Anbieter setzt höhere Preise und Prioritäten."
    },
    {
      "id": "zielgruppendefinition",
      "name": "Zielgruppendefinition",
      "description": "Festlegen, für wen ein Angebot gedacht ist, inkl. Bedarf, Budget, Branche, Nutzungskontext und Entscheidern.",
      "example": "Ein Managed-Backup-Angebot wird auf Arztpraxen zugeschnitten: Fokus auf Datenschutz, einfache Bedienung, feste monatliche Kosten."
    },
    {
      "id": "angebotsbewertung",
      "name": "Angebotsbewertung",
      "description": "Vergleich von Angeboten anhand Preis, Leistungsumfang, Qualität, Risiken, Vertragsbedingungen und Service-Level.",
      "example": "Drei Anbieter werden bewertet: Gesamtpreis (TCO), SLA/Supportzeiten, Kündigungsfristen, Referenzen und DSGVO-Vertrag (AVV)."
    },
    {
      "id": "benchmarking",
      "name": "Benchmarking",
      "description": "Systematischer Vergleich mit Wettbewerbern oder Best Practices, um die eigene Leistung einzuordnen und zu verbessern.",
      "example": "Die eigene Incident-Lösungszeit wird mit Branchenwerten verglichen; daraus werden Zielwerte und Prozessmaßnahmen abgeleitet."
    }
  ]
}
